backend/auctionroommanager/simpleloadtest.yaml
# # my-scenario.yml
# config:
#   target: "http://localhost:3000"
#   phases:
#     - duration: 60
#       arrivalRate: 10
#   engines:
#    socketio-v3: {}

# scenarios:
#   - name: My sample scenario
#     engine: socketio-v3
#     flow:
#       # wait for the WebSocket upgrade (optional)
#       - think: 1

#       # basic emit
#       - emit:
#           channel: "hello"
#           data: "world"

#       # emit an object
#       - emit:
#           channel: "hello"
#           data:
#             id: 42
#             status: "in progress"
#             tags:
#               - "tag1"
#               - "tag2"

#       # emit in a custom namespace
#       - namespace: "/my-namespace"
#         emit:
#           channel: "hello"
#           data: "world"

#       # emit with acknowledgement
#       - emit:
#           channel: "ping"
#         acknowledge:
#           match:
#             value: "pong"

#       # do nothing for 30 seconds then disconnect
#       - think: 30


config:
  target: "http://34.124.164.87/"
  socketio:
    transports: ["websocket"]
  phases:
    - duration: 10 # Run scenario for 10 seconds
      arrivalCount: 30 # Create 30 virtual users per scenario
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "newChatMessage"
          data: "Hello! {{ $randomString() }}"
      - think: 5 # do nothing for 5 seconds, then disconnect