backend/auctionroommanager/simpleloadtest.yaml
config:
  target: "http://34.124.164.87/"
  socketio:
    transports: ["websocket"]
  phases:
    - duration: 20 # Run scenario for 20 seconds
      arrivalCount: 100 # Create 100 virtual users per scenario
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "newChatMessage"
          data: "Hello! {{ $randomString() }}"
      - think: 5 # do nothing for 5 seconds, then disconnect